## Open/ Close a file with Python

In [1]:
file = open('test.txt','w')

In [2]:
file.write("Hello World!")

12

In [3]:
file.close()

In [4]:
mylist = ['Ford',"BMW","Audi","Benz","Kia"]

In [9]:
with open("test.txt",'a') as file:
    for item in mylist:
        file.write(item+'\n')

### Read the content of a file:

In [24]:
with open('test.txt') as reader:
    print(list(reader))

['Ford\tBMW\tAudi\tBenz\tKia\tFord\n', 'BMW\n', 'Audi\n', 'Benz\n', 'Kia\n']

In [20]:
content

'Ford\tBMW\tAudi\tBenz\tKia\tFord\n'

In [26]:
with open('files\\test.txt') as reader:
    print(list(reader))

['Ford\tBMW\tAudi\tBenz\tKia\tFord\n', 'BMW\n', 'Audi\n', 'Benz\n', 'Kia\n']

In [1]:
with open('files\\airtravel.csv') as reader:
    print(list(reader))

['"Month", "1958", "1959", "1960"\n', '"JAN",  340,  360,  417\n', '"FEB",  318,  342,  391\n', '"MAR",  362,  406,  419\n', '"APR",  348,  396,  461\n', '"MAY",  363,  420,  472\n', '"JUN",  435,  472,  535\n', '"JUL",  491,  548,  622\n', '"AUG",  505,  559,  606\n', '"SEP",  404,  463,  508\n', '"OCT",  359,  407,  461\n', '"NOV",  310,  362,  390\n', '"DEC",  337,  405,  432\n', '\n']

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('files\\airtravel.csv')

In [8]:
pd.read_csv('files\\airtravel.csv')

   Month   "1958"   "1959"   "1960"
0    JAN      340      360      417
1    FEB      318      342      391
2    MAR      362      406      419
3    APR      348      396      461
4    MAY      363      420      472
5    JUN      435      472      535
6    JUL      491      548      622
7    AUG      505      559      606
8    SEP      404      463      508
9    OCT      359      407      461
10   NOV      310      362      390
11   DEC      337      405      432

In [9]:
df.info() #Shows the information about the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Month    12 non-null     object
 1    "1958"  12 non-null     int64
 2    "1959"  12 non-null     int64
 3    "1960"  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

In [10]:
df.head()

  Month   "1958"   "1959"   "1960"
0   JAN      340      360      417
1   FEB      318      342      391
2   MAR      362      406      419
3   APR      348      396      461
4   MAY      363      420      472

In [12]:
df.columns

Index(['Month', ' "1958"', ' "1959"', ' "1960"'], dtype='object')

In [13]:
df.Month

0     JAN
1     FEB
2     MAR
3     APR
4     MAY
5     JUN
6     JUL
7     AUG
8     SEP
9     OCT
10    NOV
11    DEC
Name: Month, dtype: object

In [14]:
df['Month']

0     JAN
1     FEB
2     MAR
3     APR
4     MAY
5     JUN
6     JUL
7     AUG
8     SEP
9     OCT
10    NOV
11    DEC
Name: Month, dtype: object

In [27]:
df.head() # Shows the first 5 records of the dataset

  Month   "1958"   "1959"   "1960"  Total
0   JAN      340      360      417   1117
1   FEB      318      342      391   1051
2   MAR      362      406      419   1187
3   APR      348      396      461   1205
4   MAY      363      420      472   1255

In [20]:
df.columns

Index(['Month', ' "1958"', ' "1959"', ' "1960"'], dtype='object')

In [22]:
total = df[' "1958"'] + df[' "1959"'] + df[' "1960"']

In [23]:
total

0     1117
1     1051
2     1187
3     1205
4     1255
5     1442
6     1661
7     1670
8     1375
9     1227
10    1062
11    1174
dtype: int64

In [24]:
df['Total'] = total

In [25]:
df.head()

  Month   "1958"   "1959"   "1960"  Total
0   JAN      340      360      417   1117
1   FEB      318      342      391   1051
2   MAR      362      406      419   1187
3   APR      348      396      461   1205
4   MAY      363      420      472   1255

In [26]:
df.drop("Month",axis=1)

     "1958"   "1959"   "1960"  Total
0       340      360      417   1117
1       318      342      391   1051
2       362      406      419   1187
3       348      396      461   1205
4       363      420      472   1255
5       435      472      535   1442
6       491      548      622   1661
7       505      559      606   1670
8       404      463      508   1375
9       359      407      461   1227
10      310      362      390   1062
11      337      405      432   1174

In [1]:
def myfunc(message):
    print(message)